_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ЗаполнениеПередачиВПроизводствоРасходомВСтроительствеВнешняя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>УСОERP_ЗаполнениеПередачиВПроизводствоРасходомВСтроительствеВнешняя</Name>
			<Comment>Доп. обработка для подключения к документу "Внутреннее потребление товаров" для возможности заполнения расходом из строительства</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Характеристика</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Выбрать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/AccumulationRegisters/УСОERP_РасходМатериаловВСтроительстве.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<AccumulationRegister>
		<Properties>
			<Name>УСОERP_РасходМатериаловВСтроительстве</Name>
			<Comment>Расход материалов в строительстве</Comment>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Объем</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСтроительства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СМ_ОбъектыСтроительства</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Работа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_СтроительныеРаботы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Характеристика</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХарактеристикиНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/DataProcessors/УСОERP_ЗаполнениеПередачиВПроизводствоРасходомВСтроительствеВнешняя/Forms/Форма/Ext/Form/Module.bsl
&НаКлиенте
Перем КэшированныеЗначения; //используется механизмом обработки изменения реквизитов ТЧ

&НаКлиенте
Перем ПредыдущиеРеквизитыШапки; //используется для проверки при изменении реквизитов шапки

&НаКлиенте
Перем ТекущиеДанныеИдентификатор; //используется для передачи текущей строки в обработчик ожидания

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	
	Если Параметры.Свойство("ОбъектыНазначения") Тогда
		Если Параметры.ОбъектыНазначения.Количество()>0 Тогда
			СсылкаНаДокумент = Параметры.ОбъектыНазначения[0];
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		Возврат;
	КонецЕсли;
	
		
	Если СсылкаНаДокумент.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ПередачаВПроизводство Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Заполнение расходом в строительстве доступно только для хозяйственной операции: """ + "Передача в производство" + """" + ".");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Объект.ДатаНачала 		= СсылкаНаДокумент.Дата;
	Объект.ДатаОкончания 	= СсылкаНаДокумент.Дата;
	Объект.Организация		= СсылкаНаДокумент.Организация;
	Объект.Подразделение 	= СсылкаНаДокумент.Подразделение;
	Объект.Склад 			= СсылкаНаДокумент.Склад;
		
	ЗаполнитьМатериалыНаСервере();
	
	ЭтаФорма.ЗакрыватьПриЗакрытииВладельца = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПараметрыУказанияСерий = ЭтаФорма.ВладелецФормы.ПараметрыУказанияСерий;  
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыМатериалы
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	
	Если Объект.Материалы.Количество()>0 Тогда
		
		ОписаниеОповещения = Новый ОписаниеОповещения("ЗаполнитьПродолжение",ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещения,"Перед заполнением табличная часть будет очищена. Продолжить?",РежимДиалогаВопрос.ДаНет,30,КодВозвратаДиалога.Нет);
		
		
	Иначе
		
		ЗаполнитьПродолжение(КодВозвратаДиалога.Да,Новый Структура);
		
	КонецЕсли; 	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;	
	
	ЗаполнитьМатериалыНаСервере();

КонецПроцедуры 

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	
	ВыбратьВсеНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьВсе(Команда)
	ОтменитьВсеНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ПеренестиВДокумент(Команда)
	
	ТаблицаТоваровНаФорме = ЭтаФорма.ВладелецФормы.Объект.Товары;
	
	
	ЗаполнитьДокументНаСервере(ТаблицаТоваровНаФорме);
	КопироватьДанныеФормы(ТаблицаТоваровНаФорме, ЭтаФорма.ВладелецФормы.Объект.Товары);
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыОткрытия 	= Новый Структура("НачалоПериода, КонецПериода", Объект.ДатаНачала, Объект.ДатаОкончания);
	ОписаниеОповещения 	= Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыОткрытия, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	НоменклатураСервер.УстановитьУсловноеОформлениеХарактеристикНоменклатуры(ЭтаФорма,
	                                                            "МатериалыХарактеристика",
																"Объект.Материалы.ХарактеристикиИспользуются");
	
КонецПроцедуры
																		 
&НаСервере
Процедура ЗаполнитьМатериалыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты.Номенклатура,
	|	УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты.Характеристика,
	|	СУММА(УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты.КоличествоКонечныйОстаток) КАК Количество
	|ИЗ
	|	РегистрНакопления.УСОERP_РасходМатериаловВСтроительстве.ОстаткиИОбороты(
	|			&НачалоПериода,
	|			&КонецПериода,
	|			,
	|			,
	|			Организация = &Организация
	|				И Исполнитель = &Подразделение
	|				И Склад = &Склад) КАК УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты
	|ГДЕ
	|	ЕСТЬNULL(УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты.КоличествоКонечныйОстаток, 0) <> 0
	|
	|СГРУППИРОВАТЬ ПО
	|	УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты.Номенклатура,
	|	УСОERP_РасходМатериаловВСтроительствеОстаткиИОбороты.Характеристика";
	Запрос.УстановитьПараметр("НачалоПериода", Новый Граница(началодня(Объект.ДатаНачала), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("КонецПериода", Новый Граница(КонецДня(Объект.ДатаОкончания), ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Объект.Организация);
	Запрос.УстановитьПараметр("Подразделение", Объект.Подразделение);
	Запрос.УстановитьПараметр("Склад", Объект.Склад);
	
	Результат = Запрос.Выполнить();
	
	Объект.Материалы.Очистить();
	Объект.Материалы.Загрузить(Результат.Выгрузить());
	
	ПараметрыЗаполненияРеквизитов = Новый Структура;
	ПараметрыЗаполненияРеквизитов.Вставить("ЗаполнитьПризнакХарактеристикиИспользуются", Новый Структура("Номенклатура", "ХарактеристикиИспользуются"));
	НоменклатураСервер.ЗаполнитьСлужебныеРеквизитыПоНоменклатуреВКоллекции(Объект.Материалы,ПараметрыЗаполненияРеквизитов);
	

КонецПроцедуры

&НаСервере
Процедура ВыбратьВсеНаСервере()
	
	Для Каждого СтрМатериал Из Объект.Материалы Цикл
		СтрМатериал.Выбрать = Истина;
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ОтменитьВсеНаСервере()
	Для Каждого СтрМатериал Из Объект.Материалы Цикл
		СтрМатериал.Выбрать = Ложь;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьДокументНаСервере(ТаблицаТовары)
	
	//ОбъетИзменения = СсылкаНаДокумент.ПолучитьОбъект();
	//
	//ТаблицаТовары = ОбъетИзменения.Товары;
	//
	////ТЗ_ТаблицаТовары = ТаблицаТовары.Выгрузить();
	
	ВыбранныеМатериалы = Объект.Материалы.Выгрузить(Новый Структура("Выбрать", Истина));
	
	Для Каждого СтрМатериал Из  ВыбранныеМатериалы Цикл
		СтруктураПоиска = Новый структура();
		СтруктураПоиска.Вставить("Номенклатура", СтрМатериал.Номенклатура);
		СтруктураПоиска.Вставить("Характеристика", СтрМатериал.Характеристика);
		
		СтруктураДействий = Новый Структура;
		
		МассивТоваров = ТаблицаТовары.НайтиСтроки(СтруктураПоиска);
		Если МассивТоваров.Количество()>0 Тогда
			ТекущаяСтрока = МассивТоваров[0];
			ТекущаяСтрока.Количество = ТекущаяСтрока.Количество + СтрМатериал.Количество;
			
			СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок", ТекущаяСтрока.Упаковка);
			
		Иначе
			ТекущаяСтрока = ТаблицаТовары.Добавить();
			ЗаполнитьЗначенияСвойств(ТекущаяСтрока, СтрМатериал);
			
			ПарамСтатьи = Новый Структура;
			ПарамСтатьи.Вставить("Организация", Объект.Организация);
			ПарамСтатьи.Вставить("Подразделение", Объект.Подразделение);
			ПарамСтатьи.Вставить("ХозяйственнаяОперация", СсылкаНаДокумент.ХозяйственнаяОперация);
			
			СтруктураДействий.Вставить("ПроверитьХарактеристикуПоВладельцу", ТекущаяСтрока.Характеристика);
			СтруктураДействий.Вставить("ПроверитьЗаполнитьУпаковкуПоВладельцу", ТекущаяСтрока.Упаковка);
			СтруктураДействий.Вставить("ПересчитатьКоличествоУпаковок", ТекущаяСтрока.Упаковка);
			СтруктураДействий.Вставить("ЗаполнитьПризнакАналитикаРасходовОбязательна");
			СтруктураДействий.Вставить("ЗаполнитьПризнакРаспределениеНДС");
			СтруктураДействий.Вставить("ЗаполнитьСтатьюАналитикуРасходовПоУмолчанию", ПарамСтатьи);
			СтруктураДействий.Вставить("ЗаполнитьПризнакАртикул", Новый Структура("Номенклатура", "Артикул"));
			СтруктураДействий.Вставить("ЗаполнитьПризнакТипНоменклатуры", Новый Структура("Номенклатура", "ТипНоменклатуры"));
			
			ПараметрыПроверкиСерий = Новый Структура("Склад, ПараметрыУказанияСерий");
			
			ПараметрыПроверкиСерий.Склад = Новый Структура("Отправитель, Получатель", Объект.Склад, Объект.Подразделение);
			ПараметрыПроверкиСерий.ПараметрыУказанияСерий = ПараметрыУказанияСерий;
			СтруктураДействий.Вставить("ПроверитьСериюРассчитатьСтатус", ПараметрыПроверкиСерий);
			
			СтруктураДействий.Вставить("НоменклатураПриИзмененииПереопределяемый", Новый Структура("ИмяФормы, ИмяТабличнойЧасти",
			ЭтаФорма.ИмяФормы, "Товары"));
			
		КонецЕсли;
		
		
		
		КэшированныеЗначения = Неопределено;				
		ОбработкаТабличнойЧастиСервер.ОбработатьСтрокуТЧ(ТекущаяСтрока, СтруктураДействий, КэшированныеЗначения);
				
	КонецЦикла;
	
	
Конецпроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	Объект.ДатаНачала = РезультатВыбора.НачалоПериода;
	Объект.ДатаОкончания = КонецДня(РезультатВыбора.КонецПериода);
	
КонецПроцедуры

#КонецОбласти
